12emilia21/Fault-Location-Implementation/buck_converter_dma_original/c2000.syscfg
adc3.$name                          = "myADC2";
adc3.adcBase                        = "ADCB_BASE";
adc3.soc0UseSampleTimeCalculator    = true;
adc3.soc0UseCalculatedSampleTime    = true;
adc3.soc1Channel                    = "ADC_CH_ADCIN6";
adc3.soc1UseSampleTimeCalculator    = true;
adc3.soc1UseCalculatedSampleTime    = true;
adc3.soc0Name                       = "Io1";
adc3.soc1Name                       = "Io2";
adc3.interruptPulseMode             = "ADC_PULSE_END_OF_CONV";
adc3.enableInterrupt1               = true;
adc3.enableInterrupt1ContinuousMode = true;
adc3.interrupt2SOCSource            = "ADC_SOC_NUMBER1";
adc3.soc0Channel                    = "ADC_CH_ADCIN6";
adc3.enableInterrupt2ContinuousMode = true;
adc3.enableInterrupt2               = true;
adc3.enabledInts                    = ["ADC_INT_NUMBER1"];
adc3.soc0Trigger                    = "ADC_TRIGGER_EPWM3_SOCA";
adc3.soc2Name                       = "Io3";
adc3.soc2Channel                    = "ADC_CH_ADCIN6";
adc3.soc2Trigger                    = "ADC_TRIGGER_EPWM3_SOCA";
adc3.soc2UseSampleTimeCalculator    = true;
adc3.soc2UseCalculatedSampleTime    = true;
adc3.soc3Name                       = "Io4";
adc3.soc3Channel                    = "ADC_CH_ADCIN6";
adc3.soc3Trigger                    = "ADC_TRIGGER_EPWM3_SOCA";
adc3.soc3UseSampleTimeCalculator    = true;
adc3.soc3UseCalculatedSampleTime    = true;
adc3.enabledSOCs                    = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc3.soc1Trigger                    = "ADC_TRIGGER_EPWM3_SOCB";
adc3.interrupt1SOCSource            = "ADC_SOC_NUMBER1";

asysctl.analogReference        = "INTERNAL";
asysctl.analogReferenceVoltage = "1P65";

cla1.$name              = "myCLA0";
cla1.enable_CLA_TASK_4  = false;
cla1.enable_CLA_TASK_5  = false;
cla1.enable_CLA_TASK_6  = false;
cla1.enable_CLA_TASK_7  = false;
cla1.enable_CLA_TASK_8  = false;
cla1.cpuint_CLA_TASK_2  = false;
cla1.cpuint_CLA_TASK_3  = false;
cla1.cpuint_CLA_TASK_4  = false;
cla1.cpuint_CLA_TASK_8  = false;
cla1.cpuint_CLA_TASK_7  = false;
cla1.cpuint_CLA_TASK_6  = false;
cla1.cpuint_CLA_TASK_5  = false;
cla1.enable_CLA_TASK_3  = false;
cla1.trigger_CLA_TASK_1 = "CLA_TRIGGER_XINT1";
cla1.enable_CLA_TASK_2  = false;

cputimer1.$name          = "myCPUTIMER0";
cputimer1.emulationMode  = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer1.timerPrescaler = 99;
cputimer1.timerPeriod    = 9999;

dma1.$name                  = "myDMA0";
dma1.enableTriggers         = true;
dma1.continuousModeConfig   = "DMA_CFG_CONTINUOUS_ENABLE";
dma1.startChannel           = true;
dma1.srcAddressInputMode    = "VARIABLE";
dma1.destAddressInputMode   = "VARIABLE";
dma1.triggerSource          = "DMA_TRIGGER_ADCC1";
dma1.srcAddressVariable     = "ADCC0_Result_base";
dma1.destAddressVariable    = "ADCC0_results_add";
dma1.registerInterrupts     = true;
dma1.enableInterrupts       = true;
dma1.interruptMode          = "DMA_INT_AT_END";
dma1.srcBurstStep           = 1;
dma1.destBurstStep          = 1;
dma1.transferSize           = 2;
dma1.burstSize              = 4;
dma1.srcTransferStep        = -3;
dma1.destWrapStep           = -7;
dma1.useInterrupts          = true;
dma1.destWrapSize           = 2;
dma1.destTransferStep       = 1;
dma1.dmaInt.enableInterrupt = true;

dma2.$name                = "myDMA1";
dma2.enableTriggers       = true;
dma2.triggerSource        = "DMA_TRIGGER_ADCA1";
dma2.continuousModeConfig = "DMA_CFG_CONTINUOUS_ENABLE";
dma2.srcAddressInputMode  = "VARIABLE";
dma2.srcAddressVariable   = "ADCA0_Result_base";
dma2.destAddressInputMode = "VARIABLE";
dma2.destAddressVariable  = "ADCA0_results_add";
dma2.startChannel         = true;
dma2.dmaBase              = "DMA_CH2_BASE";
dma2.transferSize         = 2;
dma2.destWrapSize         = 2;
dma2.destWrapStep         = -1;
dma2.destTransferStep     = 1;
dma2.destBurstStep        = 1;

dma3.$name                = "myDMA2";
dma3.triggerSource        = "DMA_TRIGGER_ADCB1";
dma3.enableTriggers       = true;
dma3.continuousModeConfig = "DMA_CFG_CONTINUOUS_ENABLE";
dma3.srcAddressInputMode  = "VARIABLE";
dma3.srcAddressVariable   = "ADCB0_Result_base";
dma3.destAddressInputMode = "VARIABLE";
dma3.destAddressVariable  = "ADCB0_results_add";
dma3.registerInterrupts   = true;
dma3.enableInterrupts     = true;
dma3.startChannel         = true;
dma3.dmaBase              = "DMA_CH3_BASE";
dma3.srcBurstStep         = 1;
dma3.destBurstStep        = 1;
dma3.burstSize            = 2;
dma3.transferSize         = 2;
dma3.srcTransferStep      = -1;
dma3.destTransferStep     = 1;
dma3.destWrapSize         = 2;
dma3.destWrapStep         = -3;

epwm.enableInfo    = true;
epwm.enableWarning = true;

epwm1.generateCodeTemplate                                       = true;
epwm1.$name                                                      = "ControlPWM";
epwm1.epwmCounterCompare_enableShadowLoadModeCMPB                = false;
epwm1.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm1.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm1.epwmActionQualifier_t1Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm1.epwmActionQualifier_t2Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm1.epwmActionQualifier_continousSwForceReloadModeGld          = true;
epwm1.epwmCounterCompare_enableShadowLoadModeCMPA                = false;
epwm1.useInterfacePins                                           = ["EPWM#_A"];
epwm1.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmTimebase_periodGld                                     = true;
epwm1.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm1.hrpwm_enable                                               = true;
epwm1.hrpwm_autoConv                                             = true;
epwm1.hrpwm_enableCalculator                                     = true;
epwm1.epwmDeadband_delayRED                                      = 20;
epwm1.epwmDeadband_delayFED                                      = 20;
epwm1.epwmActionQualifier_continousSwForceReloadMode             = "EPWM_AQ_SW_IMMEDIATE_LOAD";
epwm1.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_T1_COUNT_UP        = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm1.epwmDeadband_enableRED                                     = true;
epwm1.epwmDeadband_enableFED                                     = true;
epwm1.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_T1_COUNT_UP        = "EPWM_AQ_OUTPUT_HIGH";
epwm1.hrpwm_syncSource                                           = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm1.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO";
epwm1.epwmTripZone_oneShotSource                                 = ["EPWM_TZ_SIGNAL_OSHT1"];
epwm1.epwmTripZone_tzInterruptSource                             = ["EPWM_TZ_INTERRUPT_OST"];
epwm1.epwmTimebase_period                                        = 1000;
epwm1.epwmCounterCompare_cmpA                                    = 500;
epwm1.epwmCounterCompare_cmpB                                    = 999;
epwm1.epwm.$assign                                               = "EPWM1";
epwm1.epwm.epwm_aPin.$assign                                     = "ball.79";
epwm1.epwm.epwm_bPin.$assign                                     = "ball.78";

epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_T1_COUNT_UP        = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmDeadband_delayRED                                      = 20;
epwm2.epwmDeadband_delayFED                                      = 20;
epwm2.useInterfacePins                                           = ["EPWM#_A"];
epwm2.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm2.epwmTimebase_periodGld                                     = true;
epwm2.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm2.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm2.epwmCounterCompare_enableShadowLoadModeCMPA                = false;
epwm2.epwmCounterCompare_enableShadowLoadModeCMPB                = false;
epwm2.epwmActionQualifier_continousSwForceReloadModeGld          = true;
epwm2.epwmActionQualifier_continousSwForceReloadMode             = "EPWM_AQ_SW_IMMEDIATE_LOAD";
epwm2.epwmActionQualifier_t1Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm2.epwmActionQualifier_t2Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_T1_COUNT_UP        = "EPWM_AQ_OUTPUT_LOW";
epwm2.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm2.epwmDeadband_enableRED                                     = true;
epwm2.epwmDeadband_enableFED                                     = true;
epwm2.hrpwm_enable                                               = true;
epwm2.hrpwm_autoConv                                             = true;
epwm2.hrpwm_enableCalculator                                     = true;
epwm2.$name                                                      = "ControlPWM_fixed_fsw";
epwm2.copyFrom                                                   = "ControlPWM";
epwm2.hrpwm_syncSource                                           = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm2.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_COUNTER_ZERO";
epwm2.epwmEventTrigger_enableInterrupt                           = true;
epwm2.epwmEventTrigger_registerInterrupts                        = true;
epwm2.epwmEventTrigger_interruptSource                           = "EPWM_INT_TBCTR_U_CMPB";
epwm2.epwmEventTrigger_interruptEventCount                       = "1";
epwm2.epwmEventTrigger_interruptEventCountInitForce              = true;
epwm2.epwmTimebase_period                                        = 1000;
epwm2.epwmCounterCompare_cmpA                                    = 500;
epwm2.epwmCounterCompare_cmpB                                    = 999;
epwm2.epwm.$assign                                               = "EPWM2";
epwm2.epwmInt.enableInterrupt                                    = true;

epwm3.epwmTimebase_emulationMode                                 = "EPWM_EMULATION_FREE_RUN";
epwm3.epwmTimebase_hsClockDiv                                    = "EPWM_HSCLOCK_DIVIDER_1";
epwm3.epwmTimebase_periodGld                                     = true;
epwm3.epwmTimebase_counterMode                                   = "EPWM_COUNTER_MODE_UP_DOWN";
epwm3.epwmTimebase_counterModeAfterSync                          = "EPWM_COUNT_MODE_UP_AFTER_SYNC";
epwm3.epwmTimebase_syncOutPulseMode                              = "EPWM_SYNC_OUT_PULSE_ON_EPWMxSYNCIN";
epwm3.hrpwm_syncSource                                           = "HRPWM_PWMSYNC_SOURCE_ZERO";
epwm3.epwmCounterCompare_enableShadowLoadModeCMPA                = false;
epwm3.epwmCounterCompare_enableShadowLoadModeCMPB                = false;
epwm3.epwmActionQualifier_continousSwForceReloadModeGld          = true;
epwm3.epwmActionQualifier_continousSwForceReloadMode             = "EPWM_AQ_SW_IMMEDIATE_LOAD";
epwm3.epwmActionQualifier_t1Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm3.epwmActionQualifier_t2Source                               = "EPWM_AQ_TRIGGER_EVENT_TRIG_EPWM_SYNCIN";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_A_ON_T1_COUNT_UP        = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_UP_CMPA   = "EPWM_AQ_OUTPUT_HIGH";
epwm3.epwmActionQualifier_EPWM_AQ_OUTPUT_B_ON_TIMEBASE_DOWN_CMPA = "EPWM_AQ_OUTPUT_LOW";
epwm3.epwmDeadband_polarityFED                                   = "EPWM_DB_POLARITY_ACTIVE_LOW";
epwm3.epwmDeadband_enableRED                                     = true;
epwm3.epwmDeadband_enableFED                                     = true;
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerEnable                  = true;
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerEventPrescalar          = "1";
epwm3.hrpwm_enable                                               = true;
epwm3.hrpwm_autoConv                                             = true;
epwm3.hrpwm_enableCalculator                                     = true;
epwm3.copyFrom                                                   = "ControlPWM_2fsw";
epwm3.$name                                                      = "ControlPWM_2fsw";
epwm3.epwmEventTrigger_EPWM_SOC_B_triggerEnable                  = true;
epwm3.epwmEventTrigger_EPWM_SOC_B_triggerEventPrescalar          = "1";
epwm3.epwmDeadband_delayRED                                      = 20;
epwm3.epwmDeadband_delayFED                                      = 20;
epwm3.epwmEventTrigger_EPWM_SOC_A_triggerSource                  = "EPWM_SOC_TBCTR_U_CMPA";
epwm3.epwmEventTrigger_EPWM_SOC_B_triggerSource                  = "EPWM_SOC_TBCTR_D_CMPA";
epwm3.epwmTimebase_period                                        = 500;
epwm3.epwmCounterCompare_cmpA                                    = 250;
epwm3.epwmCounterCompare_cmpB                                    = 499;

gpio1.$name             = "debug_pin";
gpio1.writeInitialValue = true;
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.gpioPin.$assign   = "ball.53";

gpio2.direction                 = "GPIO_DIR_MODE_OUT";
gpio2.useInterrupt              = true;
gpio2.$name                     = "transient_det_pin";
gpio2.writeInitialValue         = true;
gpio2.gpioPin.$assign           = "ball.51";
gpio2.xint.intType              = "GPIO_INT_TYPE_RISING_EDGE";
gpio2.xint.enableInt            = true;
gpio2.xint.registerInterrupts   = true;
gpio2.xint.xInt.enableInterrupt = true;

gpio3.$name             = "tz_pin";
gpio3.initialValue      = 1;
gpio3.writeInitialValue = true;
gpio3.gpioPin.$assign   = "ball.54";

inputxbar_input1.$name         = "myINPUTXBARINPUT0";
gpio2.xint.inputxbar           = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO12";

memcfg.config_MEMCFG_SECT_LS0 = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS2 = "CLA_data";
memcfg.config_MEMCFG_SECT_LS3 = "CLA_data";
memcfg.config_MEMCFG_SECT_LS4 = "CLA_prog";

FPUfastRTS1.$name = "myFFR0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm2.epwm.epwm_aPin.$suggestSolution = "ball.77";
epwm2.epwm.epwm_bPin.$suggestSolution = "ball.76";
epwm3.epwm.$suggestSolution           = "EPWM3";
epwm3.epwm.epwm_aPin.$suggestSolution = "ball.75";
epwm3.epwm.epwm_bPin.$suggestSolution = "ball.89";
